package homesbg.registration.completeForm;

import homesbg.registration.agencyData.Type;

public abstract class Messages {
	
	static void getCustomerDataMessage(Type data) {
		System.out.println("Данни за потребителя");
		if(data.equals(Type.Агенция_за_недвижими_имоти)){
			System.out.println("Този потребител ще има администраторски права. С него ще можете:\n"
					+ "- да редактирате данните за Вашата агенция\n"
					+ "- да добавяте/изтривате допълнителни потребители (брокери) с права за публикуване" 
					+ " на обяви към акаунта на агенцията\n" 
					+ "- да публикувате/разглеждате/редактирате обяви публикувани от Вас и/или други потребители (брокери)");
		}
		else{
			System.out.println("Този потребител ще има администраторски права. С него ще можете:\n"
					+ "- да редактирате данните за Вашата фирма\n"
					+ "- да добавяте/изтривате допълнителни потребители (търговци) с права за публикуване на "
					+ "обяви към акаунта на строителната фирма\n"
					+ "- да публикувате/разглеждате/редактирате обяви публикувани от Вас и/или други потребители (търговци)");
		}
	}

	static void getPageMessage(Type data) {
		if(data.equals(Type.Агенция_за_недвижими_имоти)){
			System.out.println("\nСтраница на агенцията в homes.bg\n");
			System.out.println("Тази страница съдържа всички оферти, публикувани от агенцията в homes.bg"
					+ ". Адресът на страницата се показва във визитката на агенцията под\n"
					+ "всяка оферта. Препоръчително е името на страницата да съвпада с името на агенцията."
					+ " Желаното име се изписва с малки букви на латиница, без\nинтервали. ");
		}
		else{
			System.out.println("\nСтраница на строителната фирма в homes.bg\n");
			System.out.println("Тази страница съдържа всички оферти, публикувани от строителната фирма в "
					+ "homes.bg. Адресът на страницата се показва във визитката на фирмата\nпод всяка оферта. ");
		}
	}

	static void getContactDataMessage(Type data) {
		System.out.println("\nДанни за контакт\n");
		if(data.equals(Type.Агенция_за_недвижими_имоти)){
			System.out.println("Тези данни се публикуват като част от офертите на агенцията и служат "
					+ "за контакт от страна на купувачите/наемателите с агенцията");
		}
		else{
			System.out.println("Тези данни се публикуват като част от офертите на строителната фирма "
					+ "и служат за контакт от страна на купувачите/наемателите с фирмата");
		}
	}
}
